#!/bin/bash

if [ $# -ne 6 ]; then
    echo "Введите 7 параметров"
    exit 3
fi

if [[ "$1" =~ ^[0-9]+([.][0-9]+)?$ ]]; then
    echo "Первый параметр должен быть путём"
    exit 3
elif ! [ -d "$1" ]; then
    echo "Первый параметр должен быть директорией"
    exit 3
fi
# if ! [[ "$1" =~ ^[/]{1}[a-z]*$ ]]; then
#     echo "Первый параметр должен быть абсолютным путём"
#     exit 3
# fi

if ! [[ "$2" =~ ^[0-9]+([.][0-9]+)?$ ]]; then
    echo "Второй параметр должен быть числом"
    exit 3
# else
#     if ! [ "$2" -le 100 ]; then
#         echo "Второй параметр должен быть меньше либо равен 100"
#         exit 3
#     fi
fi

if [[ "$3" =~ ^[0-9]+([.][0-9]+)?$ ]]; then
    echo "Третий параметр должен быть строкой ${#3}"
    exit 3
else 
    if ! [ "${#3}" -le 7 ]; then
        echo "Третий параметр: не более 7 символов"
        exit 3
    fi
fi

if ! [[ "$4" =~ ^[0-9]+([.][0-9]+)?$ ]]; then
    echo "Четвертый параметр должен быть числом"
    exit 3
fi

if ! [[ "$5" =~ ^[a-zA-Z]{2,7}[.][a-z]{2,3}$ ]]; then
    echo "Пятый параметр должен быть формата asdfghj.sdf"
    # echo "Прошел"
    exit 3
# else
#     echo "Не прошел"
#     exit 3
fi

if ! [[ "$6" =~ ^[0-9]{1,3}kb$ ]]; then
    echo "Шестой параметр должен быть формата 100kb"
    exit 3
else
    var=$(echo "$6" | awk -F 'kb' '{print $1}')
    if ! [ "$var" -le 100 ]; then
    echo "Шестой параметр <= 100kb"
        exit 3
    fi
    # echo $var
fi

